InformationRegisters/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПринятПоДолгосрочномуДоговору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НаборЗаписей", ЭтотОбъект.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборЗаписей.Период,
	|	НаборЗаписей.ФизЛицо,
	|	НаборЗаписей.Организация,
	|	НаборЗаписей.ПринятПоДолгосрочномуДоговору,
	|	НаборЗаписей.ПериодЗавершения,
	|	НаборЗаписей.ДатаРегистрацииИзменений,
	|	НаборЗаписей.Документ
	|ПОМЕСТИТЬ ВТНаборЗаписей
	|ИЗ
	|	&НаборЗаписей КАК НаборЗаписей
	|";
	Запрос.Выполнить(); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаборЗаписей.Период,
	|	НаборЗаписей.ФизЛицо,
	|	ВЫБОР
	|		КОГДА НаборЗаписей.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА НаборЗаписей.Организация
	|		ИНАЧЕ НаборЗаписей.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	НаборЗаписей.ПринятПоДолгосрочномуДоговору,
	|	ВЫБОР
	|		КОГДА НаборЗаписей.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НаборЗаписей.ПериодЗавершения
	|		ИНАЧЕ КОНЕЦПЕРИОДА(НаборЗаписей.ПериодЗавершения, МЕСЯЦ)
	|	КОНЕЦ КАК ПериодЗавершения,
	|	ВЫБОР
	|		КОГДА НаборЗаписей.ДатаРегистрацииИзменений = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА НаборЗаписей.Период
	|		ИНАЧЕ НаборЗаписей.ДатаРегистрацииИзменений
	|	КОНЕЦ КАК ДатаРегистрацииИзменений,
	|	НаборЗаписей.Документ
	|ИЗ
	|	ВТНаборЗаписей КАК НаборЗаписей";
	ЭтотОбъект.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
